Repository: giellalt/corpus-sme
Catalog: tmx/nob/admin/sd/white_papers/gievrras_giellamodeallat.pdf.tmx
Source language: sme
Languages: nob

source: Dokumeanttas leat dál boahtán ovdan gievrras giellamodealla guokte beali, organisatoralaš bealit mat fertejit leat sajis, ja diđolaš giellageavadat, maiguin mánáidgárddiin ja skuvllain ferte bargat vai sámegielat fálaldat doaibmá.
nob: I dokumentet er det kommet fram to sider ved sterke språkmodeller, de organisatoriske sidene som må være til stede, og de bevisste språkpraksisene som barnehagene og skolene må jobbe med for at de samiskspråklige tilbudene skal fungere.

source: Dát gullet sámegieloahpahusa struktuvrralaš eavttuide.
nob: Dette faller inn under de strukturelle forutsetningene ved samiskundervisningen.

source: Dán kapihttalis bargojoavku guorahallá iešguđet praktihkalaš beliid, mat laktásit gievrras giellamodeallaid ollašuhttimii.
nob: I dette kapittelet analyserer arbeidsgruppa forskjellige praktiske forhold som knytter seg til realiseringen av sterke språkmodeller.

source: Oahpaheddjiin ja mánáidgárdebargiin lea metodafriddjavuohta, dat mearkkaša ahte ieža besset mearridit makkár bargovugiid áigot geavahit.
nob: Lærere og barnehageansatte har metodefrihet, noe som betyr at de selv kan bestemme hvilke arbeidsmåter de vil anvende.

source: Dát kapihtal doaibmá inspirašuvdnan ja das leat ovdamearkkat movt sáhttá bargat.
nob: Dette kapittelet skal fungere som inspirasjon og gi eksempler på hvordan man kan arbeide.

source: 9.1 Mánáid sirren gielladili mielde
nob: 9.1 Differensiering av barna utfra språksituasjonen

source: Sámegielat mánáidgárde- ja oahpahusdoaimmaid ulbmil lea fállat juohke mánnái gievrras giellafálaldaga dakkár dásis, mii heive su duogážii ja dárbbuide.
nob: Målet for de samiske barnehage- og undervisningstilbudene er å tilby hvert barn et sterkt språktilbud tilpasset barnets bakgrunn og behov.

source: Oktageardánis prinsihppa lea ahte mánná ferte álo fidnet vehá eambbo go maid son máhttá: giellafálaldat ii galgga leat sutnje menddo álki, muhto ii menddo váttisge.
nob: Det enkle prinsippet er at barnet alltid skal få litt mer enn hen kan: språktilbudet skal ikke være altfor lett, men heller ikke for vanskelig .

source: Dego máŋgii lea namuhuvvon, sámemánáid duogážat ja dilit molsašuddet sakka.
nob: Som allerede nevnt, så er det store forskjeller i de samiske barnas språkbakgrunn og -situasjon.

source: Iešguđet guovlluin ja iešguđet giellajoavkkuin leat hui iešguđetlágan dilit, muhto nu leat dávjá maiddái ovtta ja seamma guovllus.
nob: Språksituasjonen varierer også mellom de forskjellige områdene og språkgruppene, men også innenfor samme område kan det være 22 forskjeller.

source: Lea hui mihtilmas dilli, ahte oassi mánáin hupmet sámegiela ruovttugiellan ja geavahit giela produktiivvalaččat, ja fas muhtun mánáin ruovttus hállojuvvo eanaš dahje dušše riikkagiella, ja máná 29 sámegiela máhttu lea eanaš reseptiivvalaš dahje váilu oalát.
nob: En karakteristisk situasjon er at en del av barna har samisk som hjemmespråk og bruker språket produktivt, mens andre barn har kun eller for det meste riksspråket som hjemmespråk, og barnets samiskkunnskap er mest reseptiv eller mangler helt.

source: Dalle okta oktasaš sámegielat joavku ii fála juohke mánnái buoremus vejolaš diliid ovdánit sámegielas iežas dási mielde.
nob: Da vil ikke én felles samiskspråklig gruppe tilby hvert barn de best mulige forutsetningene for å utvikle sitt samiske språk etter eget nivå.

source: Dat soaitá lihkostuvvat jus joavkkus leat nu ollu bargit, ahte lea vejolaš sihkkarastit juohke mánnái sámegielat fálaldaga ja doarjaga individuálalaččat.
nob: Det kan lykkes dersom gruppa har så mange ansatte at det er mulig å sikre et individuelt samiskspråklig tilbud og støtte til barnet.

source: Praktihkas dilli lea goittotge dávjá dakkár, ahte eai leat doarvái návccat jámma váldit vuhtii juohke máná, baicce giellafálaldaga ferte lágidit heajumus gielladáiddu mielde, ja dalle nanu sámegielat mánát eai oaččo doarvái doarjaga ja hástalusa iežaset ovdáneapmái.
nob: Den praktiske situasjonen er imidlertid ofte slik at det ikke er tilstrekkelig med ressurser til at man hele tiden kan ta hensyn til hvert barn, men at språktilbudet må tilrettelegges utfra den svakeste språkkunnskapen, og da får ikke de barna med sterke samiskspråklige kunnskaper tilstrekkelig støtte og utfordringer til å utvikle seg.

source: Seamma fuones molssaeaktu lea jus giellafálaldat lea menddo gáibideaddji daidda mánáide, geaid gielladáidu ii leat vel nanus ja produktiivvalaš, ja sii duššástuvvet ja bázáhallet.
nob: Et like dårlig alternativ er det dersom språktilbudet er altfor krevende for de barna som ennå ikke har en sterk og produktiv språkkunnskap, og de vil bli frustrerte og henge etter i utviklingen.

source: Dárbu fysalaččat sirret ja gáibádus váhnemiin fysalaččat sirret dán guokte mánnájoavkku badjána go giellafálaldat ii doaimma, go mánát geavahit riikkagiela sámeoahpahusas.
nob: Behovet for og krav fra foreldrene om fysisk differensiering av disse to barnegruppene oppstår gjerne når språktilbudet ikke fungerer, når barna bruker riksspråket i språktilbudet.

source: Jus dákkár dilis ii sirre, de nannenjoavkku mánát maid dárustišgohtet.
nob: Dersom differensiering ikke gjennomføres i et slikt tilfelle, vil også barna i befestningsgruppa begynne å snakke norsk.

source: Jus lihkostuvvá oamastanjoavkku mánáid giela molsut, de sirren ii oba šattage čuolbman, ja dalán go dainna lihkostuvvá, de sáhttá sirrema loahpahit.
nob: Dersom man lykkes med å få barna i tilegnelsesgruppa til å bytte språk, vil ikke differensiering være nødvendig, og med en gang man lykkes med det, kan differensiering opphøre.

source: Dakkár dilis go riikkagiella lea oamastanjoavkku mánáid gulahallangiellan mánáidgárddis dahje skuvllas, de lea buoremus lágidit guokte sierra sámegielat joavkku mánáid gielladiliid mielde.
nob: I en situasjon der riksspråket er tilegnelsesgruppas kommunikasjonsspråk i barnehagen eller i skolen, er det best å tilrettelegge to forskjellige grupper etter barnas språksituasjon.

source: Gievrras giellamodeallaid dáfus dat mearkkaša ahte seamma mánáidgárddis dahje skuvllas leat sihke joavkkut, main geavahuvvo oamastanmodealla, ja joavkkut, main geavahuvvo nannenmodealla.
nob: Når det gjelder sterke språkmodeller vil det si at det i samme barnehage eller skole er både grupper der tilegnelsesmodellen anvendes, og grupper der befestningsmodellen anvendes.

source: Suomabealde dakkár modealla doaibmá mánáidgárdedásis dan bokte, ahte leat guokte sierra tiippa sámegielat mánáidgárdejoavkku: 1) giellabeasit daidda geain ii leat sámegiella ruovttugiellan dahje muđuid vel nanu sámegiela dáidu, ja 2) eatnigielagiidda dárkkuhuvvon sámegielat joavkkut.
nob: På finsk side fungerer en slik modell på barnehagenivå på den måten at det er to forskjellige typer samiskspråklige barnegrupper: 1) språkreir for dem som ikke har samisk som hjemmespråk eller ikke ennå har sterk samiskkunnskap, og 2) samiskspråklige grupper ment for morsmålstalere.

source: Goappáge kategoriijas mánáidgárddi bargit hupmet mánáiguin dušše sámegiela, muhto giellafálaldaga dássi lea heivehuvvon mánáid gielladási mielde.
nob: I begge kategoriene snakker de ansatte i barnehagen kun samisk, men det språklige nivået i tilbudet er tilpasset barnas språknivå.

source: Giellabeasis geavahuvvo giellalávgunmetodihkka: mánáide hubmojuvvo čielgasit, guovddáš sánit ja frásat geardduhuvvojit jámma, veahkkin leat mimihkka ja govat.
nob: I språkreiret anvendes språkbadsmetodikken: det snakkes tydelig til barna, sentrale ord og fraser gjentas jevnt, og mimikk og bilder brukes som støtte.

source: Eatnigielagiiguin fas lea ee. vejolaš geavahit molsašuddi ja rikkis sámegiela álggu rájis, go sis jo leat gielalaš vuođđonávccat, maid ala sáhttá hukset máŋggabealat gielladáiddu.
nob: Med morsmålsbrukere kan man bl.a. bruke et variert og rikt samisk språk fra begynnelsen av, da de allerede innehar språklige grunnferdigheter som en allsidig språkkunnskap kan bygges på.

source: Nubbi guovddáš erohus laktása mánáid sámásteapmái.
nob: En annen sentral forskjell knytter seg til barnas bruk av samisk.

source: Eatnigielat mánáin sáhttá ja galgá vuordit produktiivvalaš sámásteami sihke ráves olbmuiguin ja gaskaneaset álggu rájis.
nob: Av de morsmålsspråklige barna kan og skal man forvente produktiv bruk av samisk både med voksne og seg imellom helt fra starten av.

source: Giellabeasis fas lea dábálaš ahte mánát hupmet álggus dušše riikkagiela, ja rávesolmmoš de bargá dainna ahte mánná oahppá sámegiela ja sámástišgoahtá.
nob: I språkreir er det derimot vanlig at barna først snakker kun riksspråket og den voksne jobber for at barnet tilegner seg og begynner å snakke samisk.

source: Dego mii leat deattuhan, sihke oamastan- ja nannenmodealla ulbmil lea máná produktiivvalaš sámegiela máhttu.
nob: Som vi har understreket, er produktiv samiskkunnskap hos barnet målet for både tilegnelses - og befestningsmodellen.

source: Mánáidgárde- ja skuvladoaimmaid ferte láhčit dan vuođul, ahte mánáidgárdeáigodaga maŋŋá mánná hupmá sámegiela produktiivvalaččat.
nob: Barnehage- og skoletilbudet må ta utgangspunkt i at barnet etter barnehageperioden snakker samisk produktivt.

source: Jus dat doaibmá, skuvllas ii leat šat dárbu sirret mánáid ruovttu gielladili mielde, nannenmodealla galggašii de heivet buohkaide.
nob: Dersom det fungerer, vil ikke skolen lenger ha behov for å differensiere barna etter språksituasjonen i hjemmet, og befestningsmodellen vil dermed passe for alle.

source: Skuvllas ferte leat plána dakkár diliid várás, jus nannemodealla mielde doaibmi skuvlaluohkkái boahtá ovttaskas mánná, guhte ii máhte sámegiela ollinge dahje seamma dásis go earrásat.
nob: Skolen bør ha en plan for situasjoner der det kommer ikke-samisktalende barn til en skoleklasse som fungerer etter befestningsmodellen, eller et barn som ikke behersker samisk på samme nivå som de andre.

source: Dálá áiggi geavvá praktihkas dávjá nu, ahte dilli gártá ovttaskas oahpaheaddjái čoavdinláhkái, ja ahte son hupmagoahtá dan ovttaskas oahppái riikkagiela, ja sáhttá gaskkohagaid olles luohkkái hupmat riikkagiela.
nob: I dag er det i praksis ofte opp til den enkelte lærer å løse situasjonen, og læreren vil da snakke riksspråket til denne eleven, og kan av og til snakke riksspråket til hele klassen.

source: Nu ii galgga leat.
nob: Slik skal det ikke være.

source: Váikkuha oalle negatiivvalaččat olles mánnájovkui, jus oahpaheaddji geavahišgoahtá riikkagiela.
nob: Det vil innvirke negativt på hele barnegruppa dersom læreren tar i bruk riksspråket.

source: Dat iige doarjjo riikagielat máná sámegiela oččodeami ja enkulturerema ja soaitá šaddat sutnje hui lossadin.
nob: Det støtter heller ikke det riksspråklige barnets enkulturering og tilegnelse av samisk, og kan føles tungt.

source: Čovdosiid ferte gávnnahit olles skuvlla dásis.
nob: Man må finne løsninger på skolenivå.

source: Lea vejolaš ahte riikkagielat oahppái fállojuvvo sierra sámegiela oahpahus dahje ahte jovkui váldojuvvo persovnnalaš veahkkebargi, gii jámma veahkeha ja doarju su gielalaččat.
nob: Man kan tilbys særskilt samiskundervisning til den riksspråklige eleven eller at gruppa tildeles en personlig assistent som kontinuerlig hjelper og støtter eleven språklig.

source: Jus dakkár oahppit leat ollu, buoremus soaitá leat lágidit sidjiide sierra joavkku, man ulbmilin lea omd. ovtta lohkanjagi siste buvttadit dakkár sámegiela dáiddu, ahte mánná sáhttá sirdásit sámegielat luohkkái.
nob: Dersom det er mange slike elever, vil det kanskje være best å tilrettelegge en egen gruppe for disse, der målet er for eksempel i løpet av ett studieår å etablere slik samiskkunnskap at barnet kan overføres til en samiskspråklig klasse.

source: Mánáid sirren guokte sierra sámejovkui sáhttá boktit dovdduid omd. váhnemiid gaskkas.
nob: Differensiering av barna i to forskjellige samiskgrupper kan vekke følelser f.eks. blant foreldrene.

source: Váhnemat soitet loavkašuvvat, jus sin máná evttohit bidjat oamastanjovkui go fas sin jurdda lea, ahte mánná máhttá sámegiela.
nob: Foreldrene kan bli støtt dersom det blir foreslått å plassere deres barn i en tilegnelsesgruppe når de mener at deres barn kan samisk.

source: Guokte sierra joavkku vuogádaga ferte plánet vuđolaččat ja dan dárbbu ferte máhttit ákkastallat servodatlaččat.
nob: Et system med to separate grupper må planlegges grundig og man må kunne argumentere for det i et samfunnsperspektiv.

source: Dat ii galgga leat makkárge árvoválljen iige identitehtagažaldat, dat ii muital geange sápmelašvuođas iige meroštala máná gelbbolašvuođa.
nob: Det skal ikke være noe verdivalg eller 23 identitetsspørsmål, det sier ingenting om noens samiskhet og vurderer heller ikke barnets kompetanse.

source: Dat lea baicce praktihkalaš vuohki doarjut juohke ovtta sámemáná su iežas dárbbuid ektui ja dainna lágiin nannet sámegiela servodagas.
nob: Det er heller en praktisk måte å støtte hvert enkelt samiske barn utfra dets behov og på den måten styrke det samiske språket i samfunnet.

source: 9.2 Gielladiđolaš barggu álggaheapmi giellafálaldagain
nob: 9.2 Igangsetting av språkbevisst arbeid i språktilbudene

source: Guokte goabbatlágan mánnájoavkku gáibidit guokte goabbatlágan bargovuogi.
nob: To forskjellige barnegrupper fordrer to forskjellige arbeidsmåter.

source: Sámis ii leat leamaš diđolašvuohta dan hárrái ahte dát guokte mánnájoavkku dárbbašit goabbat bargovuogi jus galget seamma mihtu olahit.
nob: I Sápmi har det ikke vært bevissthet om at disse to barnegruppene behøver forskjellige arbeidsmåter dersom de skal oppnå samme mål.

source: Mii leat máŋgii bargan riikkagielat ja sámegielat mánáiguin seammalágán bargovugiiguin.
nob: Ofte har vi jobbet med riksspråklige og samiskspråklige barn på samme måte.

source: Boađus lea ahte mánát riikkagielat ruovttuin eai leat šaddan produktiiva sámegielagin, ja dán láhkái lea riikkagiella vuoitán saji sámi mánáidgárddiin ja luohkáin, maiddái sámegielat mánáid gaskkas.
nob: Resultatet har vært at barna fra de riksspråklige hjemmene ikke har blitt produktivt samiskspråklige, og dermed har riksspråket vunnet terreng i samiske barnehager og klasser, også blant de samisktalende barna.

source: Go mánát, geat juo sámástit ruovttus, bohtet sámegielat mánáidgárdái dahje skuvlii, de sii jotket sámásteamis doppe jus earát maid sámástit, muhto riikkagielat mánát eai sámás dušše dainna go gullet sámegiela iežaset birra.
nob: Når barn som snakker samisk hjemme kommer i samiskspråklig barnehage eller skole, vil de fortsette å snakke samisk der dersom andre også snakker samisk . De riksspråklige barna vil derimot ikke snakke samisk bare fordi de hører samisk rundt seg.

source: Oamastanmánáid hárrái fertejit rávesolbmot diđolaččat bargat vai mánná galgá oahppat sámegiela, ja rievdadit máná giellageavaheami.
nob: For at barn lykkes med å tilegne seg samisk gjennom språktilbudet, må de voksne jobbe bevisst og endre barnets språkbruk .

source: 9.2.1 Movt álggahit gielladiđolaš barggu nannenmodeallas Máná gielalaš doarjun ja ovdánahttin lea bistevaš proseassa.
nob: 9.2.1 Hvordan sette i gang språkbevisst arbeid i befestningsmodellen Språklig støtte og utvikling av barnets språk er en vedvarende prosess.

source: Nugo ovdal leat namuhan, de galggašii máná gielalaš fálaldat álo leat veahá alit dásis go su gielalaš návccat.
nob: Som vi tidligere har nevnt, burde det språklige tilbudet til barnet alltid være på et litt høyere nivå enn dets ferdigheter.

source: Go mánná sámásta produktiivvalaččat, de lea bargun nannet ja viiddidit su gielalaš máhtu ja áddejumi.
nob: Dersom barnet snakker produktivt samisk, består oppgaven i å styrke og utvide den språklige kunnskapen og forståelsen.

source: Nannenmodealla lea jurddašuvvon mánáide geain lea sámegiella ruovttugiellan.
nob: Befestningsmodellen er ment for barn som har samisk som hjemmespråk.

source: Vaikko mánát oččoditge sámegiela lunddolaš 31 dilálašvuođas, de leat sámegielat áitatvuloš gielat.
nob: Selv om barna tilegner seg samisk i naturlige situasjoner, er de samiske språkene truet.

source: Sámegielaid sajádat ruovttugiellan lea geahnohuvvan ođđaáiggis, go riikkagielat ožžot coavcci min árgabeaivvis iešguđetlágan elektrovnnalaš rusttegiid bokte, nugo TV, dihtora, dihtordulbosiid ja dihtorspealuid.
nob: De samiske språkenes stilling som hjemmespråk er blitt svekket i nyere tid, da riksspråkene får feste i hverdagen gjennom forskjellige elektroniske innretninger, som TV, datamaskiner, nettbrett og dataspill.

source: Áigi mii ovdal geavahuvvui oalát sámegielat gulahallamii, geavahuvvo dal maiddái riikkagielat sisdoalu geahččamii ja guldaleapmái.
nob: Tiden som tidligere ble brukt fullt ut til kommunikasjon på samisk, blir nå brukt også til å se på og lytte til riksspråklig innhold.

source: Nannenmodeallat fertejit dán servodatrievdama váldit vuhtii.
nob: Befestningsmodellene må ta hensyn til denne samfunnsendringen.

source: Giella ii berre šat adnojuvvot nu diehttelassan ahte dasa ii dárbbaš láhčit saji iige plánaid.
nob: Språket bør ikke lenger oppfattes som så selvsagte at det ikke er behov for tilrettelegging og planer.

source: Maiddái nannenmodeallas fertejit leat giellaplánat ja giellapolicy, mii muitala makkár sadji sámásteamis lea, ja mii vurdojuvvo mánáid giellaovdáneamis.
nob: Også i befestningsmodellen må det være språkplaner og språkpolicy som forteller hvilken plass det å snakke samisk har, og hva som forventes av barnas språkutvikling.

source: Giellaplána berre maiddái muitalit movt mii vuostáiváldit mánáid geain ii leat sámegiella ruovttugiellan, ja makkár giellačuovvuleami sii ožžot vai olahit produktiivvalaš sámegielmáhtu, ja movt giellafálaldat bargá vai riikkagiella ii oaččo coavcci gulahallangiellan.
nob: Språkplanene bør også fortelle hvordan man tar imot de barna som ikke har samisk som hjemmespråk, og hvilken språkoppfølging de får for å oppnå produktiv samiskkunnskap, og hvordan språktilbudet jobber for at riksspråket ikke får feste som kommunikasjonsspråk.

source: Gielladiđolaš bargovuohki gáibida ahte bargit árvvoštallet sihke iežaset ja mánáid sámegielgeavaheami.
nob: En språkbevisst arbeidsmåte krever at de ansatte vurderer både egne og barnas bruk av samisk.

source: Nannenfálaldagain sáhttá vuordit ahte sámegiella lea juo gulahallangiellan mánáid guovdu.
nob: I befestningstilbudene kan man forvente at samisk allerede er kommunikasjonsspråk blant barna.

source: Lea goitge dehálaš ahte oahpaheaddjit, ja eará bargit, čađat árvvoštallet leatgo arenat dehe áiggit, go riikkagiella dattege lea geavahusas, omd. go gehččet youtube, olgun, spábbačiekčamis dehe eará falástallandoaimmain, dahje orrugo muhtun mánáin riikkagiella vuoitime gulahallangiellan.
nob: I alle fall er det viktig at lærere og andre ansatte kontinuerlig vurderer om det er arenaer og perioder der riksspråket er i bruk, f.eks. når de ser på Youtube, er ute, spiller fotball eller holder på med andre idrettsaktiviteter, eller om riksspråket ser ut til å vinne fram som kommunikasjonsspråk hos noen barn.

source: Dasto ferte geahččalit gávdnat vugiid movt viiddidit sámegiela geavaheami maiddái dáin dilálašvuođain.
nob: Deretter må man forsøke å utvide bruken av samisk også i disse situasjonene.

source: Rávesolbmot fertejit ieža leat ovdagovvan, ja sii fertejit ráhkkanit sámástit áššiid birra mat TV:s ja Youtubes gullojit aivve váldogielaide, ja fáttáid birra main ieža geavahit ollu riikkagiela sániid.
nob: De voksne må selv være forbilder, og de må forberede seg på å snakke samisk om ting som blir omtalt kun på riksspråket på Youtube og TV, og om temaer der de selv bruker mange ord på riksspråket.

source: Rávesolbmot fertejit maid sihkkarastit ahte olgodoaimmat leat buorit giellabirrasat, ja ahte mánát olgun maid besset oččodit ođđa sániid ja geavahit sámegiela.
nob: De voksne må også sikre at uteaktivitetene er gode språkarenaer, og at barna får tilegne seg nye ord og bruke samisk også i utetiden.

source: Sámegiela geavaheami viiddideapmi gáibida ahte rávesolbmot servet mánáid doaimmaide, erenoamážit dakkár diliin go oidnet ahte riikkagiella vuoitá.
nob: En utvidelse av bruken av samisk krever at de voksne deltar i barnas aktiviteter, spesielt i slike situasjoner der de ser at riksspråket vinner.

source: Rávesolbmot leat giellaovdagovvan mánáide.
nob: De voksne er barnas forbilder.

source: Sin bokte mánát ohppet giela ja dan makkár meannudeapmi lea dohkálaš go sámásta.
nob: Gjennom dem lærer barna språket og hva slags adferd som er akseptert når man snakker samisk.

source: Vaikko nannenmodeallas lea vuorddehahtti ahte mánát leat ollu oahppan ruovttus, de lea goitge nu ahte giellafálaldaga bokte mánát galget nannet ja viiddidit maid leat oahppan.
nob: Selv om det i befestningsmodellen er forventet at barna har lært mye hjemme, er det likevel slik at gjennom språktilbudet skal barna styrke og utvide det de har lært. De voksne i språktilbudet bør bevisst jobbe med sin egen språkbruk, blant annet øve seg på tydelig tale.

source: Lea maid mávssolaš ahte sii čuvvot daid giellageavahanprinsihpaid maid giellafálaldagas áigot oahpahit mánáide, ja nu maiddái unnidit riikkagiela sániid geavaheami sámásteamis.
nob: Det er også viktig at de selv følger de språkbruksprinsippene som de vil lære barna gjennom språktilbudet, og derfor også redusere bruken av ord på riksspråket når de snakker samisk.

source: Muhtumin gullá olbmuid šuohkiheame ahte ovdalhan leat maiddái seaguhan riikkagiela ja sámegiela.
nob: Av og til hører man folk sukke at også tidligere har man blandet riksspråket og samisk.

source: Manne mii galgat dán áigge váruhit nu sakka das?
nob: Hvorfor skal vi være så forsiktige med det nå?

source: Lea duohta ahte ovdal leat maid geavahan riikkagiela sániid ođđa áššiide, omd. keskus, senter, formannskáhppi, ja muhtun dákkár sánit gávdnojit 32 maiddái boares sátnegirjjiin.
nob: Det er riktig at vi tidligere også har brukt ord fra riksspråket for nye ting, f.eks. , “senter”, “formannskáhppi”, og noen slike ord finnes til og med i gamle ordbøker.

source: Giellaplánema ja normerema bokte mii leat goit ožžon sadjái sámegiel sániid ollu áššiide, nugo guovddáš ja ovdagoddi, ja riikkagielaid sánit leat dađistaga báhcán eret beaivválaš geavahusas.
nob: Gjennom språkplanlegging og normering har vi likevel fått på plass samiske ord i mange saker, som for 24 eksempel og , og ord fra riksspråket har etter hvert blitt utelatt fra daglig bruk.

source: Go rávesolbmot válljejit riikkagielaid sáni eaige baicca sámegiel sáni, de dat sáhttá leat juogalágan stiilaášši mii lea rávesolbmo válljejumi duohken.
nob: I dagens situasjon brukes ord fra riksspråket også der det finnes tilsvarende samiske ord. Når de voksne velger ord fra riksspråkene i stedet for samiske ord, kan det være et slags stilvalg som det er opp til den voksne å velge.

source: Jus rávesolbmot dávjá válljejit dáinna lágiin, de sáhttá geavvat nu ahte mánáin gártá nu unnán vásáhus sámegiel sániiguin, ahte sámegiel sátni ii oba ohppojuvvoge.
nob: Dersom de voksne ofte tar slike valg, kan det hende at barna får så liten erfaring med samiske ord at de ikke lærer det samiske ordet i det hele tatt.

source: Sámi giellafálaldagaid mihttuhan lea nannet máná giela, maiddái su sátnevuorkká.
nob: Målet for samiske språktilbud er å styrke barnets språk, også ordforrådet.

source: Danne dákkár giellaseaguheami berre garvit.
nob: Derfor bør slik språkblanding unngås.

source: Oahpaheaddjit ja bargit sáhttet searválaga ohcat sámegielsániid daidda doahpagiidda maidda geavahit riikkagiela sániid, ja dainna lágiin viiddidit maiddái iežaset sámegielgeavaheami.
nob: Lærere og de ansatte kan sammen lete opp samiske ord for de begrepene der de bruker ord fra riksspråket, og på den måten også utvide egen bruk av samisk.
